Revit 2027 API
ParameterTypeId.RepeatingDetailLayout Property
 "Layout"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RepeatingDetailLayout { get; }
Public Shared ReadOnly Property RepeatingDetailLayout As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RepeatingDetailLayout {
	ForgeTypeId^ get ();
}
static member RepeatingDetailLayout : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace